Revit 2027 API
ParameterTypeId.TagOnPlacementStructural Property
 "Tag on Placement"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId TagOnPlacementStructural { get; }
Public Shared ReadOnly Property TagOnPlacementStructural As ForgeTypeId
	Get
public:
static property ForgeTypeId^ TagOnPlacementStructural {
	ForgeTypeId^ get ();
}
static member TagOnPlacementStructural : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace